RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_usbfs_driver/inc/usb_regs.h
/*******************************************************************************
 * Macro Name     : SetEPRxTxStatus
 * Description    : sets the status for rx & tx (bits STAT_TX[1:0] & STAT_RX[1:0])
 * Input          : bEpNum: Endpoint Number.
 *                  wStaterx: new state.
 *                  wStatetx: new state.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPRxTxStatus(bEpNum, wStaterx, wStatetx)                                                                   \
    {                                                                                                                  \
        register uint32_t _wRegVal;                                                                                    \
                                                                                                                       \
        _wRegVal = _GetENDPOINT(bEpNum) & (EPRX_DATTOGMASK | EPTX_STS);                                                \
        /* toggle first bit ? */                                                                                       \
        if ((EPRX_DATTOG1 & wStaterx) != 0)                                                                            \
            _wRegVal ^= EPRX_DATTOG1;                                                                                  \
        /* toggle second bit ? */                                                                                      \
        if ((EPRX_DATTOG2 & wStaterx) != 0)                                                                            \
            _wRegVal ^= EPRX_DATTOG2;                                                                                  \
        /* toggle first bit ? */                                                                                       \
        if ((EPTX_DATTOG1 & wStatetx) != 0)                                                                            \
            _wRegVal ^= EPTX_DATTOG1;                                                                                  \
        /* toggle second bit ?  */                                                                                     \
        if ((EPTX_DATTOG2 & wStatetx) != 0)                                                                            \
            _wRegVal ^= EPTX_DATTOG2;                                                                                  \
        _SetENDPOINT(bEpNum, _wRegVal | EP_CTRS_RX | EP_CTRS_TX);                                                      \
    } /* _SetEPRxTxStatus */
/*******************************************************************************
 * Macro Name     : USB_GetEpTxSts / USB_GetEpRxSts
 * Description    : gets the status for tx/rx transfer (bits STAT_TX[1:0]
 *                  /STAT_RX[1:0])
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : status .
 *******************************************************************************/
#define _GetEPTxStatus(bEpNum) ((uint16_t)_GetENDPOINT(bEpNum) & EPTX_STS)

#define _GetEPRxStatus(bEpNum) ((uint16_t)_GetENDPOINT(bEpNum) & EPRX_STS)

/*******************************************************************************
 * Macro Name     : USB_SetEpTxValid / USB_SetEpRxValid
 * Description    : sets directly the VALID tx/rx-status into the enpoint register
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPTxValid(bEpNum) (_SetEPTxStatus(bEpNum, EP_TX_VALID))

#define _SetEPRxValid(bEpNum) (_SetEPRxStatus(bEpNum, EP_RX_VALID))

/*******************************************************************************
 * Macro Name     : USB_GetTxStallSts / USB_GetRxStallSts.
 * Description    : checks stall condition in an endpoint.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : TRUE = endpoint in stall condition.
 *******************************************************************************/
#define _GetTxStallStatus(bEpNum) (_GetEPTxStatus(bEpNum) == EP_TX_STALL)
#define _GetRxStallStatus(bEpNum) (_GetEPRxStatus(bEpNum) == EP_RX_STALL)

/*******************************************************************************
 * Macro Name     : USB_SetEpKind / USB_ClrEpKind.
 * Description    : set & clear EP_KIND bit.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEP_KIND(bEpNum)                                                                                            \
    (_SetENDPOINT(bEpNum, (EP_CTRS_RX | EP_CTRS_TX | ((_GetENDPOINT(bEpNum) | EP_KIND) & EPREG_MASK))))
#define _ClearEP_KIND(bEpNum) (_SetENDPOINT(bEpNum, (EP_CTRS_RX | EP_CTRS_TX | (_GetENDPOINT(bEpNum) & EPKIND_MASK))))

/*******************************************************************************
 * Macro Name     : USB_SetStsOut / USB_ClrStsOut.
 * Description    : Sets/clears directly STATUS_OUT bit in the endpoint register.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _Set_Status_Out(bEpNum)   _SetEP_KIND(bEpNum)
#define _Clear_Status_Out(bEpNum) _ClearEP_KIND(bEpNum)

/*******************************************************************************
 * Macro Name     : USB_SetEpDoubleBufer / USB_ClrEpDoubleBufer.
 * Description    : Sets/clears directly EP_KIND bit in the endpoint register.
 * Input          : bEpNum: Endpoint Number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPDoubleBuff(bEpNum)   _SetEP_KIND(bEpNum)
#define _ClearEPDoubleBuff(bEpNum) _ClearEP_KIND(bEpNum)

