RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_usbfs_driver/inc/usb_regs.h
/*******************************************************************************
 * Macro Name     : USB_SetEpDblBuf0Addr / USB_SetEpDblBuf1Addr.
 * Description    : Sets buffer 0/1 address in a double buffer endpoint.
 * Input          : bEpNum: endpoint number.
 *                : wBuf0Addr: buffer 0 address.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPDblBuf0Addr(bEpNum, wBuf0Addr)                                                                           \
    {                                                                                                                  \
        _SetEPTxAddr(bEpNum, wBuf0Addr);                                                                               \
    }
#define _SetEPDblBuf1Addr(bEpNum, wBuf1Addr)                                                                           \
    {                                                                                                                  \
        _SetEPRxAddr(bEpNum, wBuf1Addr);                                                                               \
    }

/*******************************************************************************
 * Macro Name     : USB_SetEpDblBuferAddr.
 * Description    : Sets addresses in a double buffer endpoint.
 * Input          : bEpNum: endpoint number.
 *                : wBuf0Addr: buffer 0 address.
 *                : wBuf1Addr = buffer 1 address.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPDblBuffAddr(bEpNum, wBuf0Addr, wBuf1Addr)                                                                \
    {                                                                                                                  \
        _SetEPDblBuf0Addr(bEpNum, wBuf0Addr);                                                                          \
        _SetEPDblBuf1Addr(bEpNum, wBuf1Addr);                                                                          \
    } /* _SetEPDblBuffAddr */

/*******************************************************************************
 * Macro Name     : USB_GetEpDblBuf0Addr / USB_GetEpDblBuf1Addr.
 * Description    : Gets buffer 0/1 address of a double buffer endpoint.
 * Input          : bEpNum: endpoint number.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _GetEPDblBuf0Addr(bEpNum) (_GetEPTxAddr(bEpNum))
#define _GetEPDblBuf1Addr(bEpNum) (_GetEPRxAddr(bEpNum))

/*******************************************************************************
 * Macro Name     : USB_SetEpDblBuferCnt / USB_SetEpDblBuf0Cnt / USB_SetEpDblBuf1Cnt.
 * Description    : Gets buffer 0/1 address of a double buffer endpoint.
 * Input          : bEpNum: endpoint number.
 *                : bDir: endpoint dir  EP_DBUF_OUT = OUT
 *                                      EP_DBUF_IN  = IN
 *                : wCount: Counter value
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
#define _SetEPDblBuf0Count(bEpNum, bDir, wCount)                                                                       \
    {                                                                                                                  \
        if (bDir == EP_DBUF_OUT)                                                                                       \
        /* OUT endpoint */                                                                                             \
        {                                                                                                              \
            _SetEPRxDblBuf0Count(bEpNum, wCount);                                                                      \
        }                                                                                                              \
        else if (bDir == EP_DBUF_IN)                                                                                   \
            /* IN endpoint */                                                                                          \
            *_pEPTxCount(bEpNum) = (uint32_t)wCount;                                                                   \
    } /* USB_SetEpDblBuf0Cnt*/

#define _SetEPDblBuf1Count(bEpNum, bDir, wCount)                                                                       \
    {                                                                                                                  \
        if (bDir == EP_DBUF_OUT)                                                                                       \
        /* OUT endpoint */                                                                                             \
        {                                                                                                              \
            _SetEPRxCount(bEpNum, wCount);                                                                             \
        }                                                                                                              \
        else if (bDir == EP_DBUF_IN)                                                                                   \
            /* IN endpoint */                                                                                          \
            *_pEPRxCount(bEpNum) = (uint32_t)wCount;                                                                   \
    } /* USB_SetEpDblBuf1Cnt */

#define _SetEPDblBuffCount(bEpNum, bDir, wCount)                                                                       \
    {                                                                                                                  \
        _SetEPDblBuf0Count(bEpNum, bDir, wCount);                                                                      \
        _SetEPDblBuf1Count(bEpNum, bDir, wCount);                                                                      \
    } /* _SetEPDblBuffCount  */

